Tekla Open API Reference for Tekla Structures 2025
FormingStates.Deforming Property
 Gets or sets the deforming type.
 Namespace: Tekla.Structures.Forming
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DeformingType Deforming { get; set; }
Public Property Deforming As DeformingType
	Get
	Set
Property Value
Type: DeformingType
See Also
Reference
FormingStates Class
Tekla.Structures.Forming Namespace